blog/Web/JavaScript/jQuery.org
#+TITLE:       jQuery
#+AUTHOR:      Pinvon
#+EMAIL:       pinvon@Inspiron
#+DATE:        2018-03-20 二
#+URI:         /blog/%y/%m/%d/jquery
#+KEYWORDS:    <TODO: insert your keywords here>
#+TAGS:        Web
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: <TODO: insert your description here>

* 声明

学习自[[https://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000/001434499993118b8173572625b4afe93a8b19dd707ea1d000][廖雪峰老师的JavaScript教程]]

* 概述

jQuery是JavaScript中使用最广泛的一个库. 使用jQuery的好处:

- 消除浏览器差异: 不需要自己写冗长的代码来针对不同的浏览器来绑定事件, 编写AJAX等代码;
- 简洁的操作DOM的方法: 写$('#test')肯定比document.getElementById('test')来得简洁;
- 轻松实现动画、修改CSS等各种操作.

可以从[[http://jquery.com/download/][jQuery官网下载]]最新版本. 

使用jQuery只需要在页面的 =<head>= 引入jQuery文件即可:
#+BEGIN_SRC HTML
<html>
<head>
    <script src="//code.jquery.com/jquery-1.11.3.min.js"></script>
    ...
</head>
<body>
    ...
</body>
</html>
#+END_SRC

jQuery把所有功能全部封装在一个全局变量jQuery中, 而$也是一个合法的变量名, 它是变量jQuery的别名:
#+BEGIN_SRC JavaScript
window.jQuery; // jQuery(selector, context)
window.$; // jQuery(selector, context)
$ === jQuery; // true
typeof($); // 'function'
#+END_SRC
=$= 本质就是一个函数, 但是函数也是对象, 所以 =$= 除了可以直接调用外, 也可以有很多其他属性.

有时候, 别的变量也被命名成了 =$= (一般不建议这么命名), 就可以使用 =.jQuery.noConflict()= 让原本作为jQuery别名的 =$= 无效.
#+BEGIN_SRC JavaScript
$; // jQuery(selector, context)
jQuery.noConflict();
$; // undefined
jQuery; // jQuery(selector, context)
#+END_SRC

* 选择器

选择器是jQuery的核心, 一个选择器写出来类似 =$('#dom-id')=.

jQuery使用选择器的原因是因为JavaScript的DOM操作中, 充斥着大量的 =getElementByXXX=, 不但写起来繁琐, 有时候定位到的节点还不止一个, 还要继续判断. 而jQuery的选择器可以帮我们 =快速定位= 到一个或多个节点.

** 按ID查找

#+BEGIN_SRC JavaScript
// 查找<div id="abc">:
var div = $('#abc');

// 返回的对象类似于: [<div id="abc">...</div>]

// jQuery对象和DOM对象可以互相转化
var divDom = div.get(0); // 假设存在div，获取第1个DOM元素
var another = $(divDom); // 重新把DOM包装为jQuery对象
#+END_SRC

** 按tag查找

#+BEGIN_SRC JavaScript
var ps = $('p'); // 返回所有<p>节点
ps.length; // 数一数页面有多少个<p>节点
#+END_SRC

** 按class查找

按class查找时, 在class名称前加一个 =.=:
#+BEGIN_SRC JavaScript
var a = $('.red.green'); // 注意.与其他字符之间没有空格！
// 符合条件的节点：
// <div class="red green">...</div>
// <div class="blue green red">...</div>
#+END_SRC

** 按属性查找

#+BEGIN_SRC JavaScript
var email = $('[name=email]'); // 找出<??? name="email">
var passwordInput = $('[type=password]'); // 找出<??? type="password">
var a = $('[items="A B"]'); // 找出<??? items="A B">
#+END_SRC

按属性查找, 可以使用前缀查找或后缀查找:
#+BEGIN_SRC JavaScript
var icons = $('[name^=icon]'); // 找出所有name属性值以icon开头的DOM
var names = $('[name$=with]'); // 找出所有name属性值以with结尾的DOM
#+END_SRC

** 组合查找

如: 查找 =$('[name=email]')=, 可能会把表单外的name=email的标签也找出来, 如果只想查找 =<input>= 中的name属性为email的DOM, 则可以这么写:
#+BEGIN_SRC JavaScript
var emailInput = $('input[name=email]'); // 不会找出<div name="email">
#+END_SRC

** 多项选择器

把多个选择器用 =,= 组合起来一块选:
#+BEGIN_SRC JavaScript
$('p,div'); // 把<p>和<div>都选出来
$('p.red,p.green'); // 把<p class="red">和<p class="green">都选出来
#+END_SRC

** 层级选择器

如果两个DOM元素具有层级关系, 就可以用 =$('祖先 后代')= 的写法来选择, 层级之间用空格隔开. 如:
#+BEGIN_SRC HTML
<!-- HTML结构 -->
<div class="testing">
    <ul class="lang">
        <li class="lang-javascript">JavaScript</li>
        <li class="lang-python">Python</li>
        <li class="lang-lua">Lua</li>
    </ul>
</div>
#+END_SRC

要选出JavaScript, 可以用层级选择器:
#+BEGIN_SRC JavaScript
$('ul.lang li.lang-javascript'); // [<li class="lang-javascript">JavaScript</li>]
$('div.testing li.lang-javascript'); // [<li class="lang-javascript">JavaScript</li>]
#+END_SRC
由于 =<div>= 和 =<ul>= 都是 =<li>= 的祖先节点, 所以这两种方式都可以选出相应的 =<li>= 节点.

*** 子选择器

与层级选择器类似, 但是限定了层级关系必须是父子关系. 写法为 =$('parent>child')=.

以上面的HTML代码为例子:
#+BEGIN_SRC JavaScript
$('ul.lang>li.lang-javascript'); // 可以选出[<li class="lang-javascript">JavaScript</li>]
$('div.testing>li.lang-javascript'); // [], 无法选出，因为<div>和<li>不构成父子关系
#+END_SRC

*** 过滤器

不单独使用, 一般附加在选择器上, 更精确地定位元素. 效果如下:
#+BEGIN_SRC JavaScript
$('ul.lang li'); // 选出JavaScript、Python和Lua 3个节点

$('ul.lang li:first-child'); // 仅选出JavaScript
$('ul.lang li:last-child'); // 仅选出Lua
$('ul.lang li:nth-child(2)'); // 选出第N个元素，N从1开始
$('ul.lang li:nth-child(even)'); // 选出序号为偶数的元素
$('ul.lang li:nth-child(odd)'); // 选出序号为奇数的元素
#+END_SRC

** 查找和过滤

通过选择器, 我们一般就可以直接定位到想要的元素了. 另外, 我们也可以在拿到一个jQuery对象后, 以该对象为基准, 进行查找和过滤.

