blog/2018/03/20/jquery/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>jQuery - Pinvon&#39;s Blog</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="Pinvon" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="Web" />
  <link rel="stylesheet" href="https://pinvondev.github.io/media/css/main.css" type="text/css"/>
  <link rel="stylesheet" href="https://pinvondev.github.io/media/css/comment.css" type="text/css"/>
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="https://pinvondev.github.io/">Pinvon&#39;s Blog</a></h1>
    <p>所见, 所闻, 所思, 所想</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
        <li><a href="https://pinvondev.github.io/years/">Years</a></li>
        <li><a href="https://pinvondev.github.io/authors/">Authors</a></li>
        <li><a href="https://pinvondev.github.io/tags/">Tags</a></li>
        <li><a href="https://pinvondev.github.io/about/">About</a></li>
        <li><a href="https://github.com/pinvondev">Github</a></li>
        <li><a href="https://pinvondev.github.io/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="pinvondev.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">jQuery</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgce1cf57">声明</a></li>
<li><a href="#org94d852a">概述</a></li>
<li><a href="#org475bb0e">选择器</a>
<ul>
<li><a href="#org4f15d07">按ID查找</a></li>
<li><a href="#org229c87f">按tag查找</a></li>
<li><a href="#orga787b30">按class查找</a></li>
<li><a href="#org1328813">按属性查找</a></li>
<li><a href="#org38c8119">组合查找</a></li>
<li><a href="#org16595ba">多项选择器</a></li>
<li><a href="#org1548f1f">层级选择器</a>
<ul>
<li><a href="#orge15347e">子选择器</a></li>
<li><a href="#orgc869d8a">过滤器</a></li>
</ul>
</li>
<li><a href="#orgf857632">查找和过滤</a>
<ul>
<li><a href="#org9a0b3d7">查找</a></li>
<li><a href="#org1a3d118">过滤</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org092623a">操作DOM</a>
<ul>
<li><a href="#org3cd8a16">修改Text和HTML</a></li>
<li><a href="#org897b2c5">修改CSS</a></li>
<li><a href="#org36b9093">显示和隐藏DOM</a></li>
<li><a href="#org594f7a1">获取DOM信息</a></li>
<li><a href="#orgdb6f06b">操作表单</a></li>
<li><a href="#org982fc07">修改DOM</a>
<ul>
<li><a href="#orgfcb7ba7">添加DOM</a></li>
<li><a href="#org03b276c">删除节点</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgea24ec6">事件</a>
<ul>
<li><a href="#orgffd3a41">事件参数</a></li>
<li><a href="#org21f5247">取消绑定</a></li>
<li><a href="#org16911d8">事件触发条件</a></li>
</ul>
</li>
<li><a href="#orgd6ab873">动画</a>
<ul>
<li><a href="#org3229755">show()/hide()</a></li>
<li><a href="#org9ab4986">slideUp()/slideDown()</a></li>
<li><a href="#orgcc44913">fadeIn()/fadeOut()</a></li>
<li><a href="#org4cbd49e">自定义动画</a></li>
<li><a href="#org23357e5">串行动画</a></li>
</ul>
</li>
<li><a href="#org909a089">AJAX</a>
<ul>
<li>
<ul>
<li><a href="#orge8516a9">ajax</a></li>
</ul>
</li>
<li><a href="#org341ba91">get</a></li>
<li><a href="#org5365840">post</a></li>
<li><a href="#org98d1b9b">getJson</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgce1cf57" class="outline-2">
<h2 id="orgce1cf57">声明</h2>
<div class="outline-text-2" id="text-orgce1cf57">
<p>
学习自<a href="https://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000/001434499993118b8173572625b4afe93a8b19dd707ea1d000">廖雪峰老师的JavaScript教程</a>
</p>
</div>
</div>

<div id="outline-container-org94d852a" class="outline-2">
<h2 id="org94d852a">概述</h2>
<div class="outline-text-2" id="text-org94d852a">
<p>
jQuery是JavaScript中使用最广泛的一个库. 使用jQuery的好处:
</p>

<ul class="org-ul">
<li>消除浏览器差异: 不需要自己写冗长的代码来针对不同的浏览器来绑定事件, 编写AJAX等代码;</li>
<li>简洁的操作DOM的方法: 写$('#test')肯定比document.getElementById('test')来得简洁;</li>
<li>轻松实现动画、修改CSS等各种操作.</li>
</ul>

<p>
可以从<a href="http://jquery.com/download/">jQuery官网下载</a>最新版本. 
</p>

<p>
使用jQuery只需要在页面的 <code>&lt;head&gt;</code> 引入jQuery文件即可:
</p>
<div class="org-src-container">
<pre class="src src-HTML">&lt;html&gt;
&lt;head&gt;
    &lt;script src="//code.jquery.com/jquery-1.11.3.min.js"&gt;&lt;/script&gt;
    ...
&lt;/head&gt;
&lt;body&gt;
    ...
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>

<p>
jQuery把所有功能全部封装在一个全局变量jQuery中, 而$也是一个合法的变量名, 它是变量jQuery的别名:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">window.jQuery; // jQuery(selector, context)
window.$; // jQuery(selector, context)
$ === jQuery; // true
typeof($); // 'function'
</pre>
</div>
<p>
<code>$</code> 本质就是一个函数, 但是函数也是对象, 所以 <code>$</code> 除了可以直接调用外, 也可以有很多其他属性.
</p>

<p>
有时候, 别的变量也被命名成了 <code>$</code> (一般不建议这么命名), 就可以使用 <code>.jQuery.noConflict()</code> 让原本作为jQuery别名的 <code>$</code> 无效.
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$; // jQuery(selector, context)
jQuery.noConflict();
$; // undefined
jQuery; // jQuery(selector, context)
</pre>
</div>
</div>
</div>

<div id="outline-container-org475bb0e" class="outline-2">
<h2 id="org475bb0e">选择器</h2>
<div class="outline-text-2" id="text-org475bb0e">
<p>
选择器是jQuery的核心, 一个选择器写出来类似 <code>$('#dom-id')</code>.
</p>

<p>
jQuery使用选择器的原因是因为JavaScript的DOM操作中, 充斥着大量的 <code>getElementByXXX</code>, 不但写起来繁琐, 有时候定位到的节点还不止一个, 还要继续判断. 而jQuery的选择器可以帮我们 <code>快速定位</code> 到一个或多个节点.
</p>
</div>

<div id="outline-container-org4f15d07" class="outline-3">
<h3 id="org4f15d07">按ID查找</h3>
<div class="outline-text-3" id="text-org4f15d07">
<div class="org-src-container">
<pre class="src src-JavaScript">// 查找&lt;div id="abc"&gt;:
var div = $('#abc');

// 返回的对象类似于: [&lt;div id="abc"&gt;...&lt;/div&gt;]

// jQuery对象和DOM对象可以互相转化
var divDom = div.get(0); // 假设存在div，获取第1个DOM元素
var another = $(divDom); // 重新把DOM包装为jQuery对象
</pre>
</div>
</div>
</div>

<div id="outline-container-org229c87f" class="outline-3">
<h3 id="org229c87f">按tag查找</h3>
<div class="outline-text-3" id="text-org229c87f">
<div class="org-src-container">
<pre class="src src-JavaScript">var ps = $('p'); // 返回所有&lt;p&gt;节点
ps.length; // 数一数页面有多少个&lt;p&gt;节点
</pre>
</div>
</div>
</div>

<div id="outline-container-orga787b30" class="outline-3">
<h3 id="orga787b30">按class查找</h3>
<div class="outline-text-3" id="text-orga787b30">
<p>
按class查找时, 在class名称前加一个 <code>.</code>:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">var a = $('.red.green'); // 注意.与其他字符之间没有空格！
// 符合条件的节点：
// &lt;div class="red green"&gt;...&lt;/div&gt;
// &lt;div class="blue green red"&gt;...&lt;/div&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1328813" class="outline-3">
<h3 id="org1328813">按属性查找</h3>
<div class="outline-text-3" id="text-org1328813">
<div class="org-src-container">
<pre class="src src-JavaScript">var email = $('[name=email]'); // 找出&lt;??? name="email"&gt;
var passwordInput = $('[type=password]'); // 找出&lt;??? type="password"&gt;
var a = $('[items="A B"]'); // 找出&lt;??? items="A B"&gt;
</pre>
</div>

<p>
按属性查找, 可以使用前缀查找或后缀查找:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">var icons = $('[name^=icon]'); // 找出所有name属性值以icon开头的DOM
var names = $('[name$=with]'); // 找出所有name属性值以with结尾的DOM
</pre>
</div>
</div>
</div>

<div id="outline-container-org38c8119" class="outline-3">
<h3 id="org38c8119">组合查找</h3>
<div class="outline-text-3" id="text-org38c8119">
<p>
如: 查找 <code>$('[name=email]')</code>, 可能会把表单外的name=email的标签也找出来, 如果只想查找 <code>&lt;input&gt;</code> 中的name属性为email的DOM, 则可以这么写:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">var emailInput = $('input[name=email]'); // 不会找出&lt;div name="email"&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org16595ba" class="outline-3">
<h3 id="org16595ba">多项选择器</h3>
<div class="outline-text-3" id="text-org16595ba">
<p>
把多个选择器用 <code>,</code> 组合起来一块选:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$('p,div'); // 把&lt;p&gt;和&lt;div&gt;都选出来
$('p.red,p.green'); // 把&lt;p class="red"&gt;和&lt;p class="green"&gt;都选出来
</pre>
</div>
</div>
</div>

<div id="outline-container-org1548f1f" class="outline-3">
<h3 id="org1548f1f">层级选择器</h3>
<div class="outline-text-3" id="text-org1548f1f">
<p>
如果两个DOM元素具有层级关系, 就可以用 <code>$('祖先 后代')</code> 的写法来选择, 层级之间用空格隔开. 如:
</p>
<div class="org-src-container">
<pre class="src src-HTML">&lt;!-- HTML结构 --&gt;
&lt;div class="testing"&gt;
    &lt;ul class="lang"&gt;
        &lt;li class="lang-javascript"&gt;JavaScript&lt;/li&gt;
        &lt;li class="lang-python"&gt;Python&lt;/li&gt;
        &lt;li class="lang-lua"&gt;Lua&lt;/li&gt;
    &lt;/ul&gt;
&lt;/div&gt;
</pre>
</div>

<p>
要选出JavaScript, 可以用层级选择器:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$('ul.lang li.lang-javascript'); // [&lt;li class="lang-javascript"&gt;JavaScript&lt;/li&gt;]
$('div.testing li.lang-javascript'); // [&lt;li class="lang-javascript"&gt;JavaScript&lt;/li&gt;]
</pre>
</div>
<p>
由于 <code>&lt;div&gt;</code> 和 <code>&lt;ul&gt;</code> 都是 <code>&lt;li&gt;</code> 的祖先节点, 所以这两种方式都可以选出相应的 <code>&lt;li&gt;</code> 节点.
</p>
</div>

<div id="outline-container-orge15347e" class="outline-4">
<h4 id="orge15347e">子选择器</h4>
<div class="outline-text-4" id="text-orge15347e">
<p>
与层级选择器类似, 但是限定了层级关系必须是父子关系. 写法为 <code>$('parent&gt;child')</code>.
</p>

<p>
以上面的HTML代码为例子:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$('ul.lang&gt;li.lang-javascript'); // 可以选出[&lt;li class="lang-javascript"&gt;JavaScript&lt;/li&gt;]
$('div.testing&gt;li.lang-javascript'); // [], 无法选出，因为&lt;div&gt;和&lt;li&gt;不构成父子关系
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc869d8a" class="outline-4">
<h4 id="orgc869d8a">过滤器</h4>
<div class="outline-text-4" id="text-orgc869d8a">
<p>
不单独使用, 一般附加在选择器上, 更精确地定位元素. 效果如下:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$('ul.lang li'); // 选出JavaScript、Python和Lua 3个节点

$('ul.lang li:first-child'); // 仅选出JavaScript
$('ul.lang li:last-child'); // 仅选出Lua
$('ul.lang li:nth-child(2)'); // 选出第N个元素，N从1开始
$('ul.lang li:nth-child(even)'); // 选出序号为偶数的元素
$('ul.lang li:nth-child(odd)'); // 选出序号为奇数的元素
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf857632" class="outline-3">
<h3 id="orgf857632">查找和过滤</h3>
<div class="outline-text-3" id="text-orgf857632">
<p>
通过选择器, 我们一般就可以直接定位到想要的元素了. 另外, 我们也可以在拿到一个jQuery对象后, 以该对象为基准, 进行查找和过滤.
</p>
</div>
