blog/Web/JavaScript/jQuery.org
*** 查找

有如下HTML代码:
#+BEGIN_SRC HTML
<!-- HTML结构 -->
<ul class="lang">
    <li class="js dy">JavaScript</li>
    <li class="dy">Python</li>
    <li id="swift">Swift</li>
    <li class="dy">Scheme</li>
    <li name="haskell">Haskell</li>
</ul>
#+END_SRC

通过 =find()= 查找:
#+BEGIN_SRC JavaScript
var ul = $('ul.lang'); // 获得<ul>
var dy = ul.find('.dy'); // 获得JavaScript, Python, Scheme
var swf = ul.find('#swift'); // 获得Swift
var hsk = ul.find('[name=haskell]'); // 获得Haskell
#+END_SRC

=parent()=: 从当前节点开始向上查找, 可带参数.

=next()=, =prev()=: 查找同一层级的节点, 可带参数.

*** 过滤

=filter()= 可以过滤掉不符合选择器条件的节点.
#+BEGIN_SRC JavaScript
var langs = $('ul.lang li'); // 拿到JavaScript, Python, Swift, Scheme和Haskell
var a = langs.filter('.dy'); // 拿到JavaScript, Python, Scheme
#+END_SRC

* 操作DOM

使用选择器拿到jQuery对象后, 可以对相应的DOM节点进行操作.

** 修改Text和HTML

=text()=: 获取节点的文本.
=html()=: 获取节点的原始HTML文本.

假设有如下HTML结构:
#+BEGIN_SRC HTML
<!-- HTML结构 -->
<ul id="test-ul">
    <li class="js">JavaScript</li>
    <li name="book">Java &amp; JavaScript</li>
</ul>
#+END_SRC

分别获取文本和HTML:
#+BEGIN_SRC JavaScript
$('#test-ul li[name=book]').text(); // 'Java & JavaScript'
$('#test-ul li[name=book]').html(); // 'Java &amp; JavaScript'
#+END_SRC

这两个方法如果没有参数, 就是获取信息, 如果有参数, 就是设置信息.
#+BEGIN_SRC JavaScript
j1.html('<span style="color: red">JavaScript</span>');
j2.text('JavaScript & ECMAScript');
#+END_SRC

一个jQuery对象可以包含0个或任意多个DOM对象, 它的方法会作用在对应的每个DOM节点上. 如:
#+BEGIN_SRC JavaScript
$('#test-ul li').text('JS'); // 两个节点都变成了JS
#+END_SRC

** 修改CSS

由于jQuery对象可以批量操作, 所以修改CSS时比较方便.

=css('name', 'value')=. 如: 
#+BEGIN_SRC JavaScript
$('#test-css li.dy>span').css('background-color', '#ffd351').css('color', 'red');
#+END_SRC

css('name'): 获取CSS属性
css('name', 'value'): 设置CSS属性
css('name', ''): 清除CSS属性

** 显示和隐藏DOM

=show()= 和 =hide()=.

** 获取DOM信息

#+BEGIN_SRC JavaScript
// 浏览器可视窗口大小:
$(window).width(); // 800
$(window).height(); // 600

// HTML文档大小:
$(document).width(); // 800
$(document).height(); // 3500

// 某个div的大小:
var div = $('#test-div');
div.width(); // 600
div.height(); // 300
div.width(400); // 设置CSS属性 width: 400px，是否生效要看CSS是否有效
div.height('200px'); // 设置CSS属性 height: 200px，是否生效要看CSS是否有效
#+END_SRC

#+BEGIN_SRC JavaScript
// <div id="test-div" name="Test" start="1">...</div>
var div = $('#test-div');
div.attr('data'); // undefined, 属性不存在
div.attr('name'); // 'Test'
div.attr('name', 'Hello'); // div的name属性变为'Hello'
div.removeAttr('name'); // 删除name属性
div.attr('name'); // undefined
#+END_SRC

** 操作表单

对于表单元素, jQuery对象统一提供 =val()= 方法获取和设置对应的 =value= 属性.
#+BEGIN_SRC JavaScript
/*
    <input id="test-input" name="email" value="">
    <select id="test-select" name="city">
        <option value="BJ" selected>Beijing</option>
        <option value="SH">Shanghai</option>
        <option value="SZ">Shenzhen</option>
    </select>
    <textarea id="test-textarea">Hello</textarea>
*/
var
    input = $('#test-input'),
    select = $('#test-select'),
    textarea = $('#test-textarea');

input.val(); // 'test'
input.val('abc@example.com'); // 文本框的内容已变为abc@example.com

select.val(); // 'BJ'
select.val('SH'); // 选择框已变为Shanghai

textarea.val(); // 'Hello'
textarea.val('Hi'); // 文本区域已更新为'Hi'
#+END_SRC

** 修改DOM

*** 添加DOM

要添加新的DOM节点, 除了通过jQuery的 =html()= 这种暴力方法外, 还可以用 =append()=.

HTML结构:
#+BEGIN_SRC HTML
<div id="test-div">
    <ul>
        <li><span>JavaScript</span></li>
        <li><span>Python</span></li>
        <li><span>Swift</span></li>
    </ul>
</div>
#+END_SRC

向列表新增一个语言:
#+BEGIN_SRC JavaScript
var ul = $('#test-div>ul');  // 拿到ul节点
ul.append('<li><span>Haskell</span></li>');
#+END_SRC

=append()= 把DOM添加到最后, =prepend()= 把DOM添加到最前.

对于同级节点, 可以使用 =after()= 或 =before()= 方法添加DOM.

*** 删除节点

要删除DOM节点，拿到jQuery对象后直接调用 =remove()= 方法就可以了.

* 事件

因为JavaScript在浏览器中以单线程模式运行, 页面加载后, 一旦页面上所有的JavaScript代码被执行完后, 就只能依赖触发事件来执行JavaScript代码.

浏览器在接收到用户的鼠标或键盘输入后, 会自动在对应的DOM节点上触发相应的事件. 如果该节点已经绑定了对应的JavaScript处理函数, 该函数就会自动调用.

由于不同的浏览器绑定事件的代码都不太一样, 所以用jQuery来写代码, 就屏蔽了不同浏览器的差异, 我们总是编写相同的代码.

例子:
#+BEGIN_SRC JavaScript
/* HTML:
 *
 * <a id="test-link" href="#0">点我试试</a>
 *
 */

// 获取超链接的jQuery对象:
var a = $('#test-link');
a.on('click', function () {
    alert('Hello!');
});
#+END_SRC

=on()= 方法用来绑定一个事件, 参数为事件名称和处理函数.

也可以写成(推荐这种写法):
#+BEGIN_SRC JavaScript
a.click(function (){
	alert('Hello!');
});
#+END_SRC

jQuery能够绑定的事件主要有:

=鼠标事件=:
click: 鼠标单击时触发；
dblclick：鼠标双击时触发；
mouseenter：鼠标进入时触发；
mouseleave：鼠标移出时触发；
mousemove：鼠标在DOM内部移动时触发；
hover：鼠标进入和退出时触发两个函数，相当于mouseenter加上mouseleave。

=键盘事件=:
keydown：键盘按下时触发；
keyup：键盘松开时触发；
keypress：按一次键后触发。

=其他事件=:
focus：当DOM获得焦点时触发；
blur：当DOM失去焦点时触发；
change：当<input>、<select>或<textarea>的内容改变时触发；
submit：当<form>提交时触发；
ready：当页面被载入并且DOM树完成初始化后触发。

其中, ready仅作用于document对象, 该事件在DOM完成初始化后触发, 且只触发一次,  非常常用.

如果想给<form>表单绑定submit事件, 先看一个错误写法:
#+BEGIN_SRC JavaScript
<html>
<head>
    <script>
        // 代码有误:
        $('#testForm).on('submit', function () {
            alert('submit!');
        });
    </script>
</head>
<body>
    <form id="testForm">
        ...
    </form>
</body>
#+END_SRC
错误原因是JavaScript在执行的时候, <form>尚未载入浏览器, 所以 =$('#testForm')= 返回 =[]=, 并没有绑定事件到任何DOM上.

正确的做法是把自己的初始化代码放到document对象的ready事件中, 保证DOM已完成初始化.
#+BEGIN_SRC JavaScript
<html>
<head>
    <script>
        $(document).on('ready', function () {
            $('#testForm).on('submit', function () {
                alert('submit!');
            });
        });
    </script>
</head>
<body>
    <form id="testForm">
        ...
    </form>
</body>
#+END_SRC

由于ready事件非常普遍, 可以简化成:
#+BEGIN_SRC JavaScript
$(function () {
    // init...
});
#+END_SRC

** 事件参数

有些事件, 如mousemove和keypress, 我们需要获取鼠标位置和按键的值, 否则监听这些事件就没什么意义了. 所有事件都会传入Event对象作为参数, 可以从Event对象上获取到更多的信息:
#+BEGIN_SRC JavaScript
$(function () {
    $('#testMouseMoveDiv').mousemove(function (e) {
        $('#testMouseMoveSpan').text('pageX = ' + e.pageX + ', pageY = ' + e.pageY);
    });
});
#+END_SRC

