blog/2018/03/20/jquery/index.html

<div id="outline-container-org9a0b3d7" class="outline-4">
<h4 id="org9a0b3d7">查找</h4>
<div class="outline-text-4" id="text-org9a0b3d7">
<p>
有如下HTML代码:
</p>
<div class="org-src-container">
<pre class="src src-HTML">&lt;!-- HTML结构 --&gt;
&lt;ul class="lang"&gt;
    &lt;li class="js dy"&gt;JavaScript&lt;/li&gt;
    &lt;li class="dy"&gt;Python&lt;/li&gt;
    &lt;li id="swift"&gt;Swift&lt;/li&gt;
    &lt;li class="dy"&gt;Scheme&lt;/li&gt;
    &lt;li name="haskell"&gt;Haskell&lt;/li&gt;
&lt;/ul&gt;
</pre>
</div>

<p>
通过 <code>find()</code> 查找:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">var ul = $('ul.lang'); // 获得&lt;ul&gt;
var dy = ul.find('.dy'); // 获得JavaScript, Python, Scheme
var swf = ul.find('#swift'); // 获得Swift
var hsk = ul.find('[name=haskell]'); // 获得Haskell
</pre>
</div>

<p>
<code>parent()</code>: 从当前节点开始向上查找, 可带参数.
</p>

<p>
<code>next()</code>, <code>prev()</code>: 查找同一层级的节点, 可带参数.
</p>
</div>
</div>

<div id="outline-container-org1a3d118" class="outline-4">
<h4 id="org1a3d118">过滤</h4>
<div class="outline-text-4" id="text-org1a3d118">
<p>
<code>filter()</code> 可以过滤掉不符合选择器条件的节点.
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">var langs = $('ul.lang li'); // 拿到JavaScript, Python, Swift, Scheme和Haskell
var a = langs.filter('.dy'); // 拿到JavaScript, Python, Scheme
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org092623a" class="outline-2">
<h2 id="org092623a">操作DOM</h2>
<div class="outline-text-2" id="text-org092623a">
<p>
使用选择器拿到jQuery对象后, 可以对相应的DOM节点进行操作.
</p>
</div>

<div id="outline-container-org3cd8a16" class="outline-3">
<h3 id="org3cd8a16">修改Text和HTML</h3>
<div class="outline-text-3" id="text-org3cd8a16">
<p>
<code>text()</code>: 获取节点的文本.
<code>html()</code>: 获取节点的原始HTML文本.
</p>

<p>
假设有如下HTML结构:
</p>
<div class="org-src-container">
<pre class="src src-HTML">&lt;!-- HTML结构 --&gt;
&lt;ul id="test-ul"&gt;
    &lt;li class="js"&gt;JavaScript&lt;/li&gt;
    &lt;li name="book"&gt;Java &amp;amp; JavaScript&lt;/li&gt;
&lt;/ul&gt;
</pre>
</div>

<p>
分别获取文本和HTML:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$('#test-ul li[name=book]').text(); // 'Java &amp; JavaScript'
$('#test-ul li[name=book]').html(); // 'Java &amp;amp; JavaScript'
</pre>
</div>

<p>
这两个方法如果没有参数, 就是获取信息, 如果有参数, 就是设置信息.
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">j1.html('&lt;span style="color: red"&gt;JavaScript&lt;/span&gt;');
j2.text('JavaScript &amp; ECMAScript');
</pre>
</div>

<p>
一个jQuery对象可以包含0个或任意多个DOM对象, 它的方法会作用在对应的每个DOM节点上. 如:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$('#test-ul li').text('JS'); // 两个节点都变成了JS
</pre>
</div>
</div>
</div>

<div id="outline-container-org897b2c5" class="outline-3">
<h3 id="org897b2c5">修改CSS</h3>
<div class="outline-text-3" id="text-org897b2c5">
<p>
由于jQuery对象可以批量操作, 所以修改CSS时比较方便.
</p>

<p>
<code>css('name', 'value')</code>. 如: 
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$('#test-css li.dy&gt;span').css('background-color', '#ffd351').css('color', 'red');
</pre>
</div>

<p>
css('name'): 获取CSS属性
css('name', 'value'): 设置CSS属性
css('name', ''): 清除CSS属性
</p>
</div>
</div>

<div id="outline-container-org36b9093" class="outline-3">
<h3 id="org36b9093">显示和隐藏DOM</h3>
<div class="outline-text-3" id="text-org36b9093">
<p>
<code>show()</code> 和 <code>hide()</code>.
</p>
</div>
</div>

<div id="outline-container-org594f7a1" class="outline-3">
<h3 id="org594f7a1">获取DOM信息</h3>
<div class="outline-text-3" id="text-org594f7a1">
<div class="org-src-container">
<pre class="src src-JavaScript">// 浏览器可视窗口大小:
$(window).width(); // 800
$(window).height(); // 600

// HTML文档大小:
$(document).width(); // 800
$(document).height(); // 3500

// 某个div的大小:
var div = $('#test-div');
div.width(); // 600
div.height(); // 300
div.width(400); // 设置CSS属性 width: 400px，是否生效要看CSS是否有效
div.height('200px'); // 设置CSS属性 height: 200px，是否生效要看CSS是否有效
</pre>
</div>

<div class="org-src-container">
<pre class="src src-JavaScript">// &lt;div id="test-div" name="Test" start="1"&gt;...&lt;/div&gt;
var div = $('#test-div');
div.attr('data'); // undefined, 属性不存在
div.attr('name'); // 'Test'
div.attr('name', 'Hello'); // div的name属性变为'Hello'
div.removeAttr('name'); // 删除name属性
div.attr('name'); // undefined
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb6f06b" class="outline-3">
<h3 id="orgdb6f06b">操作表单</h3>
<div class="outline-text-3" id="text-orgdb6f06b">
<p>
对于表单元素, jQuery对象统一提供 <code>val()</code> 方法获取和设置对应的 <code>value</code> 属性.
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">/*
    &lt;input id="test-input" name="email" value=""&gt;
    &lt;select id="test-select" name="city"&gt;
        &lt;option value="BJ" selected&gt;Beijing&lt;/option&gt;
        &lt;option value="SH"&gt;Shanghai&lt;/option&gt;
        &lt;option value="SZ"&gt;Shenzhen&lt;/option&gt;
    &lt;/select&gt;
    &lt;textarea id="test-textarea"&gt;Hello&lt;/textarea&gt;
*/
var
    input = $('#test-input'),
    select = $('#test-select'),
    textarea = $('#test-textarea');

input.val(); // 'test'
input.val('abc@example.com'); // 文本框的内容已变为abc@example.com

select.val(); // 'BJ'
select.val('SH'); // 选择框已变为Shanghai

textarea.val(); // 'Hello'
textarea.val('Hi'); // 文本区域已更新为'Hi'
</pre>
</div>
</div>
</div>

<div id="outline-container-org982fc07" class="outline-3">
<h3 id="org982fc07">修改DOM</h3>
<div class="outline-text-3" id="text-org982fc07">
</div>
<div id="outline-container-orgfcb7ba7" class="outline-4">
<h4 id="orgfcb7ba7">添加DOM</h4>
<div class="outline-text-4" id="text-orgfcb7ba7">
<p>
要添加新的DOM节点, 除了通过jQuery的 <code>html()</code> 这种暴力方法外, 还可以用 <code>append()</code>.
</p>

<p>
HTML结构:
</p>
<div class="org-src-container">
<pre class="src src-HTML">&lt;div id="test-div"&gt;
    &lt;ul&gt;
        &lt;li&gt;&lt;span&gt;JavaScript&lt;/span&gt;&lt;/li&gt;
        &lt;li&gt;&lt;span&gt;Python&lt;/span&gt;&lt;/li&gt;
        &lt;li&gt;&lt;span&gt;Swift&lt;/span&gt;&lt;/li&gt;
    &lt;/ul&gt;
&lt;/div&gt;
</pre>
</div>

<p>
向列表新增一个语言:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">var ul = $('#test-div&gt;ul');  // 拿到ul节点
ul.append('&lt;li&gt;&lt;span&gt;Haskell&lt;/span&gt;&lt;/li&gt;');
</pre>
</div>

<p>
<code>append()</code> 把DOM添加到最后, <code>prepend()</code> 把DOM添加到最前.
</p>

<p>
对于同级节点, 可以使用 <code>after()</code> 或 <code>before()</code> 方法添加DOM.
</p>
</div>
</div>

<div id="outline-container-org03b276c" class="outline-4">
<h4 id="org03b276c">删除节点</h4>
<div class="outline-text-4" id="text-org03b276c">
<p>
要删除DOM节点，拿到jQuery对象后直接调用 <code>remove()</code> 方法就可以了.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgea24ec6" class="outline-2">
<h2 id="orgea24ec6">事件</h2>
<div class="outline-text-2" id="text-orgea24ec6">
<p>
因为JavaScript在浏览器中以单线程模式运行, 页面加载后, 一旦页面上所有的JavaScript代码被执行完后, 就只能依赖触发事件来执行JavaScript代码.
</p>

<p>
浏览器在接收到用户的鼠标或键盘输入后, 会自动在对应的DOM节点上触发相应的事件. 如果该节点已经绑定了对应的JavaScript处理函数, 该函数就会自动调用.
</p>

<p>
由于不同的浏览器绑定事件的代码都不太一样, 所以用jQuery来写代码, 就屏蔽了不同浏览器的差异, 我们总是编写相同的代码.
</p>

<p>
例子:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">/* HTML:
 *
 * &lt;a id="test-link" href="#0"&gt;点我试试&lt;/a&gt;
 *
 */

// 获取超链接的jQuery对象:
var a = $('#test-link');
a.on('click', function () {
    alert('Hello!');
});
</pre>
</div>

<p>
<code>on()</code> 方法用来绑定一个事件, 参数为事件名称和处理函数.
</p>

<p>
也可以写成(推荐这种写法):
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">a.click(function (){
    alert('Hello!');
});
</pre>
</div>

<p>
jQuery能够绑定的事件主要有:
</p>

<p>
<code>鼠标事件</code>:
click: 鼠标单击时触发；
dblclick：鼠标双击时触发；
mouseenter：鼠标进入时触发；
mouseleave：鼠标移出时触发；
mousemove：鼠标在DOM内部移动时触发；
hover：鼠标进入和退出时触发两个函数，相当于mouseenter加上mouseleave。
</p>

<p>
<code>键盘事件</code>:
keydown：键盘按下时触发；
keyup：键盘松开时触发；
keypress：按一次键后触发。
</p>

<p>
<code>其他事件</code>:
focus：当DOM获得焦点时触发；
blur：当DOM失去焦点时触发；
change：当&lt;input&gt;、&lt;select&gt;或&lt;textarea&gt;的内容改变时触发；
submit：当&lt;form&gt;提交时触发；
ready：当页面被载入并且DOM树完成初始化后触发。
</p>

<p>
其中, ready仅作用于document对象, 该事件在DOM完成初始化后触发, 且只触发一次,  非常常用.
</p>

<p>
如果想给&lt;form&gt;表单绑定submit事件, 先看一个错误写法:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">&lt;html&gt;
&lt;head&gt;
    &lt;script&gt;
        // 代码有误:
        $('#testForm).on('submit', function () {
            alert('submit!');
        });
    &lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;form id="testForm"&gt;
        ...
    &lt;/form&gt;
&lt;/body&gt;
</pre>
</div>
<p>
错误原因是JavaScript在执行的时候, &lt;form&gt;尚未载入浏览器, 所以 <code>$('#testForm')</code> 返回 <code>[]</code>, 并没有绑定事件到任何DOM上.
</p>

<p>
正确的做法是把自己的初始化代码放到document对象的ready事件中, 保证DOM已完成初始化.
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">&lt;html&gt;
&lt;head&gt;
    &lt;script&gt;
        $(document).on('ready', function () {
            $('#testForm).on('submit', function () {
                alert('submit!');
            });
        });
    &lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;form id="testForm"&gt;
        ...
    &lt;/form&gt;
&lt;/body&gt;
</pre>
</div>

<p>
由于ready事件非常普遍, 可以简化成:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$(function () {
    // init...
});
</pre>
</div>
</div>

<div id="outline-container-orgffd3a41" class="outline-3">
<h3 id="orgffd3a41">事件参数</h3>
<div class="outline-text-3" id="text-orgffd3a41">
<p>
有些事件, 如mousemove和keypress, 我们需要获取鼠标位置和按键的值, 否则监听这些事件就没什么意义了. 所有事件都会传入Event对象作为参数, 可以从Event对象上获取到更多的信息:
</p>
<div class="org-src-container">
<pre class="src src-JavaScript">$(function () {
    $('#testMouseMoveDiv').mousemove(function (e) {
        $('#testMouseMoveSpan').text('pageX = ' + e.pageX + ', pageY = ' + e.pageY);
    });
});
</pre>
</div>
</div>
</div>
